Public Member Functions | Protected Attributes | List of all members
ACAPI::AddonNotificationInterface Class Reference
API Infrastructure
AddonNotificationInterface is the abstract base class for every concrete notification interface class. More...
#include <AddonNotificationInterface.hpp>
 Inheritance diagram for ACAPI::AddonNotificationInterface:
 Public Member Functions
AddonNotificationInterface (const API_Guid &notificationIdentifier)
Creates and registers the AddonNotificationInterface.
 Protected Attributes
 const API_Guid  | notificationIdentifier
Identifier given by constructor.
Detailed Description
AddonNotificationInterface is the abstract base class for every concrete notification interface class.
Since
Archicad 29
Constructor & Destructor Documentation
◆ AddonNotificationInterface()
 ACAPI::AddonNotificationInterface::AddonNotificationInterface  |  ( |  const API_Guid & |  notificationIdentifier | )
explicit
Creates and registers the AddonNotificationInterface.
Parameters
notificationIdentifier | API guid that identifies the notification implementation.